# YOLOv8m 固定结构 (自己建立的模型，略大于官方模型)
nc: 10

backbone:
  - [-1, 1, Conv, [48, 3, 2]]      # 0
  - [-1, 1, Conv, [96, 3, 2]]      # 1
  - [-1, 2, C2f, [96]]              # 2 (3*0.67≈2)
  - [-1, 1, Conv, [192, 3, 2]]     # 3
  - [-1, 4, C2f, [192]]             # 4 (6*0.67≈4)
  - [-1, 1, Conv, [384, 3, 2]]     # 5
  - [-1, 4, C2f, [384]]             # 6 (6*0.67≈4)
  - [-1, 1, Conv, [768, 3, 2]]     # 7
  - [-1, 2, C2f, [768]]             # 8 (3*0.67≈2)
  - [-1, 1, SPPF, [768, 5]]        # 9

head:
  - [[4, 6, -1], 1, NLTEM, [256, 256]]
  - [-1, 1, GET_TEM, [768, 2]]   # 11  9  1024
  - [-2, 1, GET_TEM, [384, 1]]   # 12  6  512
  - [-3, 1, GET_TEM, [192, 0]]   # 13  4  256

  - [11, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 12], 1, Concat, [1]]      # 15
  - [-1, 3, C2f, [384]]            # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17
  - [[-1, 13], 1, Concat, [1]]      # 18
  - [-1, 3, C2f_DEF_CBAM, [192]]            # 19
  - [-1, 1, MAMBA, [ 192, 4, 1, 1, 0.1, 2, 1 ] ]  # 20

  - [-1, 1, Conv, [192, 3, 2]]     # 21
  - [[-1, 12], 1, Concat, [1]]     # 22
  - [-1, 3, C2f_DEF_CBAM, [384]]            # 23
  - [-1, 1, MAMBA, [ 384, 4, 1, 1, 0.1, 2, 1 ] ]  # 24

  - [-1, 1, Conv, [384, 3, 2]]     # 15
  - [[-1, 9], 1, Concat, [1]]      # 26
  - [-1, 3, C2f_DEF_CBAM, [768]]            # 27
  - [-1, 1, MAMBA, [ 768, 4, 1, 1, 0.1, 2, 1 ] ]  # 28

  - [[20, 24, 28], 1, Detect, [nc]]  # 22