# YOLOv8m 固定结构 (自己建立的模型，略大于官方模型)
nc: 80

backbone:
  - [-1, 1, Conv, [48, 3, 2]]      # 0
  - [-1, 1, Conv, [96, 3, 2]]      # 1
  - [-1, 2, C2f, [96]]              # 2 (3*0.67≈2)
  - [-1, 1, Conv, [192, 3, 2]]     # 3
  - [-1, 4, C2f, [192]]             # 4 (6*0.67≈4)
  - [-1, 1, Conv, [384, 3, 2]]     # 5
  - [-1, 4, C2f, [384]]             # 6 (6*0.67≈4)
  - [-1, 1, Conv, [768, 3, 2]]     # 7
  - [-1, 2, C2f, [768]]             # 8 (3*0.67≈2)
  - [-1, 1, SPPF, [768, 5]]        # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]      # 11
  - [-1, 3, C2f, [384]]            # 12 (重复次数=3，非缩放)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]      # 14
  - [-1, 3, C2f, [192]]            # 15

  - [-1, 1, Conv, [192, 3, 2]]     # 16
  - [[-1, 12], 1, Concat, [1]]     # 17
  - [-1, 3, C2f, [384]]            # 18

  - [-1, 1, Conv, [384, 3, 2]]     # 19
  - [[-1, 9], 1, Concat, [1]]      # 20
  - [-1, 3, C2f, [768]]            # 21

  - [[15, 18, 21], 1, Detect, [nc]]  # 22